Revit 2026 API

# AlignmentStationLabelSetOptions Class

---

Represents an object containing options for creating a set of AlignmentStationLabel.

SystemObject Autodesk.Revit.DB.InfrastructureAlignmentStationLabelSetOptions

**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AlignmentStationLabelSetOptions
```
```vb
Public Class AlignmentStationLabelSetOptions
```
```cpp
public ref class AlignmentStationLabelSetOptions
```
```fsharp
type AlignmentStationLabelSetOptions = class end
```

The AlignmentStationLabelSetOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlignmentStationLabelSetOptions | Create an object with default values. |

|  | Name | Description |
| --- | --- | --- |
|  | EndStation | The ending station for creating labels in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, the station value corresponding to the alignment's DisplayedEndStation is used. |
|  | HasLeader | Specifies if the label will have a leader. The default value is true. |
|  | Interval | The interval between labels to be created in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, a predefined interval value will be used, depending on the unit setting for stationing units in the document. For standard imperial, the default is 100 ft. For survey imperial, the default is 100 USft (US survey). For metric, the default is 1000 m. |
|  | Offset | The offset of the labels from the alignment, in Revit internal paper space units (standard Imperial feet). A positive offset creates labels to the right of the alignment, a negative - to the left. The default value is null. If null, a predefined offset value will be used, depending on the unit setting for stationing units in the document. For standard imperial, the default is 1/8". For survey imperial, the default is 1/8" (US survey). For metric, the default is 5 mm. |
|  | StartStation | The starting station for creating labels in the set, in Revit internal model units (standard Imperial feet). The default value is null. When null, the station value corresponding to the alignment's DisplayedStartStation is used. |
|  | TypeId | Specifies the ElementId of the labels' type. The default value is InvalidElementId. in this case, CreateSet(Alignment, View, AlignmentStationLabelSetOptions) will throw an exception. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Infrastructure Namespace